{"meta":{"title":"强化学习课程","subtitle":"学习理论、在线优化、网络技术","description":"","author":"John Doe","url":"https://Reinforcement-Learning.github.io","root":"/"},"pages":[{"title":"","date":"2024-12-12T03:11:49.419Z","comments":true,"path":"research/index.html","permalink":"https://reinforcement-learning.github.io/research/","excerpt":"","text":"研究方向 Machine Learning Online Learning: Experts, Bandits, Online Convex Optimization, Multi-scale Online Learing，Online Learning with Attacks&#x2F;Corruptions Distributed Learning&#x2F;Estimation Statistical Learning Optimization and Operation Research: Knapsack, Job Scheduling, Ski Rental, Online Linear Programming, Online Decision Making etc. Foundation Model Include both “ML for Foundation Model“ and “Foundation Model for ML“, such as optimizing the implementation of LLMs in Edge etc. 发表论文： Asynchronous Multi-Agent Bandits: Fully Distributed vs. Leader-Coordinated AlgorithmsXuchuang Wang, Janice Chen, Xutong Liu, , Lin Yang*, Mohammad Hajiesmaili, John CS Lui, Don Towsley ACM International Conference on Measurement and Modeling of Computer Systems (SIGMETRICS), June 2025. (Full Paper) [AISTATS 2023] On-Demand Communication for Asynchronous Multi-Agent Bandits (to appear)Yu-zhen Janice Chen, Lin Yang*, Xuchuang Wang, Xutong Liu, Mohammad Hajiesmaili, John C.S. Lui, Don TowsleyThe 26th International Conference on Artificial Intelligence and Statistics (AISTATS 2023), 2023. [ICLR 2023] Achieve Near-Optimal Individual Regret &amp; Low Communications in Multi-Agent Bandits (to appear)Xuchuang Wang, Lin Yang*, Yu-zhen Janice Chen, Xutong Liu, Mohammad Hajiesmaili, Don Towsley, John C.S. LuiThe Eleventh International Conference on Learning Representations (ICLR 2023), 2023. [SIGMETRICS 2023] The Online Knapsack Problem with DeparturesBo Sun#, Lin Yang#, Mohammad Hajiesmaili, Adam Wierman, Don TowsleyACM International Conference on Measurement and Modeling of Computer Systems (SIGMETRICS), June 2023. (Full Paper). [SIGMETRICS 2022] Hierarchical Learning Algorithms for Multi-scale Expert ProblemsLin Yang, Yu-zhen Chen, Mohammad Hajiesmaili, Mark Herbster, Don TowsleyACM International Conference on Measurement and Modeling of Computer Systems (SIGMETRICS), June 2022. (Full Paper)Journal Version: Proceedings of the ACM on Measurement and Analysis of Computing Systems (POMACS), 2022, 6(2): 1-29. [INFOCOM 2022] Distributed Bandits with Heterogeneous AgentsLin Yang, Yu-zhen Chen, Mohammad Hajiesmaili, John CS Lui, Don TowsleyIEEE International Conference on Computer Communications (INFOCOM), 2022. [SIGMETRICS 2022] Competitive Algorithms for Online Multidimensional Knapsack ProblemsLin Yang, Ali Zeynali, Mohammad Hajiesmaili, Ramesh Sitaraman, Donald F. TowsleyACM International Conference on Measurement and Modeling of Computer Systems (SIGMETRICS), June 2022. (Full Paper)Journal Version: Proceedings of the ACM on Measurement and Analysis of Computing Systems (POMACS), 2021, 5(3): 1-30. [NeurIPS 2021] Cooperative Stochastic Bandits with Asynchronous Agents and Constrained FeedbackLin Yang, Yu-Zhen Janice Chen, Stephen Pasteris, Mohammad Hajiesmaili, John CS Lui, Don TowsleyAdvances in Neural Information Processing Systems (NeurIPS), 2021. [Performance 2021] Competitive Bidding Strategies for Online Linear Optimization with Inventory Management ConstraintsRussell Lee, Yutao Zhou, Lin Yang, Mohammad Hajiesmaili, Ramesh SitaramanIFIP Performance, 2021. Learning Based Control Policy and Regret Analysis for Online Quadratic Optimization with Asymmetric Information Structure Cheng Tan, Lin Yang*, Wing Shing Wong Transactions on Cybernetics, 2021. [NeurIPS 2020] Adversarial Bandits with Corruptions: Regret Lower Bound and No-regret AlgorithmLin Yang, Mohammad Hajiesmaili, Mohammad Sadegh Talebi, John CS Lui, Wing Shing WongAdvances in Neural Information Processing Systems (NeurIPS), 2020. [SIGMETRICS 2020] Online Linear Optimization with Inventory Management ConstraintsLin Yang#, Mohammad Hajiesmaili#, Ramesh Sitaraman, Adam Wierman, Enrique Mallada, Wing Shing WongACM International Conference on Measurement and Modeling of Computer Systems (SIGMETRICS), June 2020. (Full Paper)Journal Version: Proceedings of the ACM on Measurement and Analysis of Computing Systems (POMACS), 2020, 4(1): 1-29. Online Linear Programming with Uncertain ConstraintsLin Yang, Mohammad H. Hajiesmaili, and Wing Shing WongProceedings of The 53rd Annual Conference on Information Sciences and Systems (CISS). 2019. (Invited Paper) Stabilization of Discrete Time Stochastic System with Input Delay and Control Dependent Noise Cheng Tan, Lin Yang, Fangfang Zhang, Zhenqiang Zhang and Wing Shing WongSystems &amp; Control Letters, 2019, 123: 62–68. An Average Queue-Length-Difference-Based Congestion Detection Algorithm in TCP&#x2F;AQM NetworkJin Zhu, Tong Luo, Lin Yang, Wanqing Xie, and G. E. DullerudInternational Journal of Adaptive Control and Signal Processing. 2018. [SIGMETRICS 2017] Hour-Ahead Offering Strategies in Electricity Market for Power Producers with Storage and Intermittent SupplyLin Yang#, Mohammad H. Hajiesmaili#, Hanling Yi, and Minghua ChenACM International Conference on Measurement and Modeling of Computer Systems (SIGMETRICS), June 2017. (Poster Paper) Gittins Index Based Control Policy for a Class of Pursuit-Evasion ProblemsCheng Tan, Changbao Xu, Lin Yang, and Wing Shing WongIET Control Theory and Applications, 12(1), 110-118, 2017. Competitive Online Algorithms for Geographical Load Balancing in Data Centers with Energy StorageChi-Kin Chau, Lin YangProceedings of the 5th International Workshop on Energy Efficient Data Centres. 2016. An Optimal Vertical Handoff Decision Algorithm for Multiple Services with Different Priorities in Heterogeneous Wireless NetworksJin Zhu, Limin Xu, Lin Yang, Wanqing XieWireless Personal Communications 83 (1), 527-549, 2015. [ComLett] Time Series Analysis for Congestion Detection in TCP&#x2F;AQM NetworksLin Yang, Jin Zhu, Wanqing Xie, and G. E. DullerudIEEE Communications Letters, 19(3), 331-334, 2015. ​ (#: Equal Contribution or Co-first Author; *: Corresponding Author)"},{"title":"","date":"2024-12-13T08:23:15.130Z","comments":true,"path":"member/index.html","permalink":"https://reinforcement-learning.github.io/member/","excerpt":"","text":"办公室: 南京大学苏州校区 个人主页: https://yanglin2021.github.io/index.html 教育背景（Lin Yang）： 2015年8月 - 2018年8月 Ph.D. in Information Engineering, The Chinese University of Hong Kong, Hong Kong. Advisor: Wing Shing Wong (FIEEE) Thesis: Competitive and Regret Analysis for Online Optimization 2012年8月 - 2015年6月 Master in Automatic Control , University of Science and Technology of China, Hefei. Advisor: Jin Zhu 2008年8月 - 2012年6月 Bachelor in Information Science , University of Science and Technology of China, Hefei. 邮箱: linyang@nju.edu.cn, yanglin.cuhk@gmail.com 相关链接: homepage , Google Scholar , CV 博士生: 硕士生: 本科生: 科研助理:"},{"title":"","date":"2024-12-12T03:15:06.939Z","comments":true,"path":"activity/index.html","permalink":"https://reinforcement-learning.github.io/activity/","excerpt":"","text":"实验室活动 实验室团建"},{"title":"","date":"2024-12-13T07:11:06.572Z","comments":true,"path":"project/index.html","permalink":"https://reinforcement-learning.github.io/project/","excerpt":"","text":"项目 XX方法验证和评估 — JWKJW重大项目 — 课题负责人 异构数据环境中分布式在线学习研究 — 国家自然科学基金（青年）项目 — 主持 异构数据环境地通信分布式在线学习算法研究 — 江苏省基础研究计划（青年）项目 — 主持 基于在线机器学习的TopK推荐算法 — 江苏省双创博士项目 — 主持 边端大模型的轻量化以及FPGA部署 — 苏州市关键核心技术“揭榜挂帅”攻关 — 课题负责人 基于单极式拓扑的高效高功率密度微型光储逆变器及系统研发 — 苏州市关键核心技术“揭榜挂帅”攻关 — 课题负责人 基于趋同的分布式在线学习研究 — 全国重点实验室创新项目（青年） — 主持 基于人工智能的光伏电网电弧检测 — 企业横向 — 主持 面向测试场景集质量评估的评估工具开发 — 2024航天一院联合创新 — 主持 机器学习前沿理论和算法研究 — 南京大学苏州校区人才启动经费项目 — 主持"},{"title":"","date":"2025-02-16T13:52:44.314Z","comments":true,"path":"course/index.html","permalink":"https://reinforcement-learning.github.io/course/","excerpt":"","text":"强化学习与多智能体第一部分：强化学习基础（6个主题） 主题1：强化学习简介与核心概念 强化学习定义、Agent-Environment交互框架 奖励、策略、值函数、探索与利用 示例：迷宫问题、多臂老虎机 作业1（提交时间：待定）：内容待定 主题2：马尔可夫决策过程（MDP） 状态、动作、转移概率、折扣因子 贝尔曼方程与最优策略求解 实践：手动计算小型MDP的最优策略 作业2（提交时间：待定）：内容待定 主题3：动态规划与值迭代 策略评估、策略改进、策略迭代算法 值迭代与异步动态规划 实验：GridWorld编程实现 作业3（提交时间：待定）：内容待定 主题4：蒙特卡洛方法与时序差分学习 蒙特卡洛策略评估与控制 TD(0)、SARSA、Q-Learning算法 实践：OpenAI Gym的CliffWalking环境 作业4（提交时间：待定）：内容待定 主题5：函数逼近与策略梯度 线性函数逼近、状态特征表示 策略梯度定理与REINFORCE算法 实验：CartPole平衡问题 作业5（提交时间：待定）：内容待定 主题6：深度强化学习（DQN） Q-Learning的神经网络扩展 经验回放与目标网络 案例：Atari游戏训练（Breakout） 作业6（提交时间：待定）：内容待定 第二部分：多智能体系统基础（4个主题）主题7：多智能体系统简介 MAS定义、分类（合作&#x2F;竞争&#x2F;混合） 通信、协调与博弈论基础 示例：无人机编队、交通信号控制 作业7（提交时间：待定）：内容待定 主题8：博弈论与纳什均衡 博弈矩阵、优势策略、混合策略 纳什均衡存在性与求解 实践：囚徒困境与石头剪刀布模拟 作业8（提交时间：待定）：内容待定 主题9：多智能体环境建模 部分可观测马尔可夫决策过程（POMDP） 共同目标与个体目标设计 实验：PettingZoo多智能体环境配置 作业9（提交时间：待定）：内容待定 主题10：经典多智能体算法 合同网协议（Contract Net Protocol） 黑板系统与拍卖机制 案例：物流任务分配模拟 作业10（提交时间：待定）：内容待定 第三部分：多智能体强化学习（4个主题） 主题11：独立Q学习（IQL）与局限性 独立Agent设计与非平稳性问题 实验：多智能体GridWorld合作任务 挑战：环境不稳定性分析 作业11（提交时间：待定）：内容待定 主题12：中心化训练与分散执行（CTDE） MADDPG算法原理 集中式Critic与分布式Actor 实践：合作捕食者-猎物环境 作业12（提交时间：待定）：内容待定 主题13：合作多智能体算法 值分解网络（VDN、QMIX） 通信机制设计（如CommNet） 案例：《星际争霸》微操任务 作业13（提交时间：待定）：内容待定 主题14：竞争与混合场景算法 双人零和博弈与Minimax-Q 多智能体PPO（MAPPO） 实验：对抗性足球游戏环境 作业14（提交时间：待定）：内容待定 第四部分：高级主题与应用（2个主题） 主题15：多智能体强化学习前沿 课程学习（Curriculum Learning） 元学习与迁移学习在MAS中的应用 论文讨论：最新顶会研究（如ICML&#x2F;NeurIPS） 作业15（提交时间：待定）：内容待定 主题16：行业应用与项目展示 自动驾驶车队协同 多机器人协作（如仓储物流） 学生分组项目汇报与点评 期末项目（提交时间：待定）：内容待定 课程特色 工具链：结合Python、PyTorch、OpenAI Gym&#x2F;PettingZoo、ML-Agents 实验设计：每主题包含1小时理论 + 40分钟代码实践 + 20分钟讨论 评估方式：课后编程作业（50%）+ 期末多智能体项目（50%）"}],"posts":[{"title":"","slug":"强化学习课程","date":"2025-02-17T05:45:55.294Z","comments":true,"path":"2025/02/17/强化学习课程/","link":"","permalink":"https://reinforcement-learning.github.io/2025/02/17/%E5%BC%BA%E5%8C%96%E5%AD%A6%E4%B9%A0%E8%AF%BE%E7%A8%8B/","excerpt":"","text":"强化学习与多智能体第一部分：强化学习基础（6个主题） 主题1：强化学习简介与核心概念 强化学习定义、Agent-Environment交互框架 奖励、策略、值函数、探索与利用 示例：迷宫问题、多臂老虎机 作业1（提交时间：待定）：内容待定 主题2：马尔可夫决策过程（MDP） 状态、动作、转移概率、折扣因子 贝尔曼方程与最优策略求解 实践：手动计算小型MDP的最优策略 作业2（提交时间：待定）：内容待定 主题3：动态规划与值迭代 策略评估、策略改进、策略迭代算法 值迭代与异步动态规划 实验：GridWorld编程实现 作业3（提交时间：待定）：内容待定 主题4：蒙特卡洛方法与时序差分学习 蒙特卡洛策略评估与控制 TD(0)、SARSA、Q-Learning算法 实践：OpenAI Gym的CliffWalking环境 作业4（提交时间：待定）：内容待定 主题5：函数逼近与策略梯度 线性函数逼近、状态特征表示 策略梯度定理与REINFORCE算法 实验：CartPole平衡问题 作业5（提交时间：待定）：内容待定 主题6：深度强化学习（DQN） Q-Learning的神经网络扩展 经验回放与目标网络 案例：Atari游戏训练（Breakout） 作业6（提交时间：待定）：内容待定 第二部分：多智能体系统基础（4个主题）主题7：多智能体系统简介 MAS定义、分类（合作&#x2F;竞争&#x2F;混合） 通信、协调与博弈论基础 示例：无人机编队、交通信号控制 作业7（提交时间：待定）：内容待定 主题8：博弈论与纳什均衡 博弈矩阵、优势策略、混合策略 纳什均衡存在性与求解 实践：囚徒困境与石头剪刀布模拟 作业8（提交时间：待定）：内容待定 主题9：多智能体环境建模 部分可观测马尔可夫决策过程（POMDP） 共同目标与个体目标设计 实验：PettingZoo多智能体环境配置 作业9（提交时间：待定）：内容待定 主题10：经典多智能体算法 合同网协议（Contract Net Protocol） 黑板系统与拍卖机制 案例：物流任务分配模拟 作业10（提交时间：待定）：内容待定 第三部分：多智能体强化学习（4个主题） 主题11：独立Q学习（IQL）与局限性 独立Agent设计与非平稳性问题 实验：多智能体GridWorld合作任务 挑战：环境不稳定性分析 作业11（提交时间：待定）：内容待定 主题12：中心化训练与分散执行（CTDE） MADDPG算法原理 集中式Critic与分布式Actor 实践：合作捕食者-猎物环境 作业12（提交时间：待定）：内容待定 主题13：合作多智能体算法 值分解网络（VDN、QMIX） 通信机制设计（如CommNet） 案例：《星际争霸》微操任务 作业13（提交时间：待定）：内容待定 主题14：竞争与混合场景算法 双人零和博弈与Minimax-Q 多智能体PPO（MAPPO） 实验：对抗性足球游戏环境 作业14（提交时间：待定）：内容待定 第四部分：高级主题与应用（2个主题） 主题15：多智能体强化学习前沿 课程学习（Curriculum Learning） 元学习与迁移学习在MAS中的应用 论文讨论：最新顶会研究（如ICML&#x2F;NeurIPS） 作业15（提交时间：待定）：内容待定 主题16：行业应用与项目展示 自动驾驶车队协同 多机器人协作（如仓储物流） 学生分组项目汇报与点评 期末项目（提交时间：待定）：内容待定 课程特色 工具链：结合Python、PyTorch、OpenAI Gym&#x2F;PettingZoo、ML-Agents 实验设计：每主题包含1小时理论 + 40分钟代码实践 + 20分钟讨论 评估方式：课后编程作业（50%）+ 期末多智能体项目（50%）","categories":[],"tags":[]}],"categories":[],"tags":[]}